---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoCurvesInRailing
source: html/d7132e14-4f39-3275-990a-667f651d3178.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoCurvesInRailing Property

Railing Sketch has no Lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoCurvesInRailing { get; }
```